"""
Яка чверть?
https://www.e-olymp.com/uk/problems/918
Задано точку з координатами х та у. Визначити, в якій координатній чверті вона розміщена.
Вхідні дані
У єдиному рядку через пропуск задано 2 дійсні числа - координати точки, значення координат по модулю не перевищують 100.
Вихідні дані
Єдине число - номер відповідної чверті, або 0, якщо однозначно визначити чверть неможливо.
Вхідні дані
12 31
Вихідні дані
1
2.7.
"""
x,y=[float(n) for n in input().split()]

if x>0 and y>0 :
    print(1)

elif x<0 and y>0 :
    print(2)

elif x<0 and y<0 :
    print(3)

elif x>0 and y<0 :
    print(4)

else:
    print(0)
